backend/app/controllers/notes_controller.rb

  def index
    @notes = Note.where user_id: @user.id
---
SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]

  def create
    @note = Note.new(note_params)
    @note.user = @user

    if @note.save
---
INSERT INTO "notes" ("title", "body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "First test note"], ["body", "Ask Lay about the format of the stickers"], ["user_id", 1], ["created_at", "2021-04-08 01:50:01.479827"], ["updated_at", "2021-04-08 01:50:01.479827"]]

  def update
    if @note.update(note_params)
---
UPDATE "notes" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "notes"."id" = $4  [["title", "Second test note"], ["body", "Dont forget to commit the code"], ["updated_at", "2021-04-08 01:56:10.309441"], ["id", 2]]